<?php

// +----------------------------------------------------------------------
// | 选项字典
// +----------------------------------------------------------------------

return array(
    'boolean' => [0 => '否', 1 => '是'],  //是否
    'yn' => ['n' => '否', 'y' => '是'],  //是否
    'is_valid' => [0 => '无效', 1 => '有效'],  //是否有效
    'is_enable' => [0 => '禁用', 1 => '启用'],  //是否启用
    //表单成员类型
    'form_type' => [
        'text'           => '文本',
        'number'         => '数字',
        'money'          => '金额',
        'textarea'       => '文本域',
        'rich_text'      => '富文本',
        'select'         => '选择',
        'radio'          => '单选框',
        'checkbox'       => '选择框',
        'img'            => '图片',
        'file'           => '文件',
        'video'          => '视频',
        'date'           => '日期，例子：2020-2-19',
        'time'           => '时间，例子：00:00:00',
        'datetime'       => '日期时间，例子：2020-2-19 00:00:00',
        'date_range'     => '日期范围，例子：2020-2-19 -2020-3-1',
        'time_range'     => '时间范围，例子：00:00:00 - 01:01:00',
        'datetime_range' => '日期时间范围，例子：2020-2-19 00:00:00 - 2020-2-24 01:01:01',
        'map'            => '地图，经纬度，百度地图',
        'addr'           => '地址，省市区+详细地址',
        'cascade'        => '级联选择，例子元素分类选项，解决单表全量的数据',
        'select_ajax'    => '搜索选项，输入关键词后加载选项',
        'cascade_ajax'   => '搜索级联，输入关键词后加载选项',

    ],
    //自定义表单类型
    'custom_table_type' => [
        1 => '常规表格',
        2 => '带树形结构的表格',
        3 => '带tab的表格',
    ],
    //自定义按钮类型
    'custom_button_type' => [
        1 => '常规弹框',
        2 => '新页面',
        3 => '新表单页面',
        4 => '自定义按钮'
    ],
    //自定义表单类型
    'custom_form_type' => [
        1 => '常规表单',
        2 => '可视化自定义表单',
    ],
    'sex' => [0 => '未知', 1 => '男', 2 => '女'],  //性别
    'marry_type' => ['single' => '未婚', 'married' => '已婚', 'divorced' => '离婚', 'widowed' => '丧偶'],  //婚姻状态
    'education' => ['senior' => '高中', 'college' => '大专', 'bachelor' => '本科', 'master' => '硕士', 'doctoral' => '博士', 'other' => '其他'],  //学历
    'func_type' => [1 => '常规函数', 2 => '静态函数', 3 => '全局函数'], //函数类型
    'func_return_type' => [0 => '常规', 1 => '布尔值'], //返回值类型
    'thread_status' => [
        THREAD_STATUS_CREATE => '创建', 
        THREAD_STATUS_IN => '处理中',
        THREAD_STATUS_PASS => '通过',
        THREAD_STATUS_CLOSE => '终止', 
        THREAD_STATUS_REFUSE => '回退',
        THREAD_STATUS_SUSPEND => '冻结',
    ], //线程状态
);
